-- Create some test data in the parameters database
-- Note that since the UI logic only shows things in the near future,
-- you may need to run this every few days :)

use parameters;



insert into model (xhdm, xhmc)
values
       -- model
       ('C11', '电信手机');

insert into fashej (sbdm, sbmc,pcdm,location,freq,pd_upper,pd_lower,num,freq_upper,
freq_lower,bw,base_power,tzlx,bzf,mid_freq,comment1)
values
       -- fashej
       ('333333002','发射机01','asd2w23sds212211111','m',2.4,0,2.8,10,0,2.8,20,1.1,'AM-V',2,1,' 常用发射机1'),
       ('333333003','发射机03','asd2w23sds212211222','m',2.4,0,2.8,20,0,2.8,30,1.2,'Pulse',2,1,'带滤波'),
       ('111102005','发射机05','asd2w23sds212211223','m',5,5,5,30,5,5,40,1.3,'AM-C',5,2,'高功率'),
       ('111102006','发射机06','asd2w23sds212213554','m',2.4,0,2.8,40,0,2.8,50,1.4,'Pulse',2,1,'常用发射机4'),
       ('111103008','中继通信站','asd2w23sds212216975','m',5,0,8,50,0,8,60,1.5,'FM',5,2,'中频'),
       ('111103009','手机','asd2w23sds218816975','m',1,0,2,60,0,2,70,1.6,'AM-C',1,0.5,'中频'),
       ('333333001','发射机1','asd2w23sds212458175','m',0,0,0,70,0,0,80,1.7,'FM',0,0,'基带');

insert into fashetx (cssbdm,cssdmc,pcdm,location,gain,polarization,
  fwbskd,fybskd,txzxj)
values
      --fashetx
      ('sb-1234','发射天线1','pc-1-pass','m',10.2,'Ver',30,20,10),
      ('sb-1235','发射天线2','pc-2-pass','m',10.7,'Hor',31,10,20),
      ('sb-1236','发射天线3','pc-3-pass','m',11.2,'Cir',32,0,30),
      ('sb-1237','发射天线4','pc-4-pass','m',11.7,'Ver',33,-10,40),
      ('sb-1238','发射天线5','pc-5-pass','m',12.2,'Hor',34,-20,50),
      ('sb-1239','发射天线6','pc-6-pass','m',12.7,'Cir',35,-30,60),
      ('sb-1240','发射天线7','pc-7-pass','m',13.2,'Ver',-36,-40,70),
      ('sb-1241','发射天线8','pc-8-pass','m',13.7,'Hor',-37,-50,80),
      ('sb-1242','发射天线9','pc-9-pass','m',14.2,'Cir',-38,-60,90),
      ('sb-1243','发射天线10','pc-10-pass','m',14.7,'Ver',-39,-70,100);

insert into jieshouj (sbdm,sbdm,pcdm,location,fb_upper,fb_lower,
  freq,f_upper,f_lower,bw_receiver,sen_receiver,mf_freq_sign,mf_freq,lo_freq)
values
      -- jieshouj
      ('sb-1234','接收机1','sb-1234-1','m',1800,900,300,1500,1000,50000,-90,'1',300,1500),
      ('sb-1235','接收机2','sb-1235-2','m',1850,950,300,1550,1050,50000,-91,'-1',300,1550),
      ('sb-1236','接收机3','sb-1236-3','m',1900,1000,300,1600,1100,50000,-92,'1',300,1600),
      ('sb-1237','接收机4','sb-1237-4','m',1950,1050,300,1650,1150,50000,-93,'1',300,1650),
      ('sb-1238','接收机5','sb-1238-5','m',2000,1100,300,1700,1200,50000,-94,'-1',300,1700),
      ('sb-1239','接收机6','sb-1239-6','m',2050,1150,300,1750,1250,50000,-95,'-1',300,1750),
      ('sb-1240','接收机7','sb-1240-7','m',2100,1200,300,1800,1300,50000,-96,'-1',300,1800),
      ('sb-1241','接收机8','sb-1234-8','m',2150,1250,300,1850,1350,50000,-97,'-1',300,1850),
      ('sb-1242','接收机9','sb-1241-9','m',2200,1300,300,1900,1400,50000,-98,'1',300,1900),
      ('sb-1243','接收机10','sb-1242-10','m',2250,1350,300,1950,1450,50000,-99,'1',300,1950);

insert into jieshoutx (cssbdm,cssbmc,pcdm,location,gain,polarization,fwbskd,
fybskd,txzxj)
values
      --jieshoutx
      ('sb-1234','接收天线1','pc-1-pass','m',10.2,'Ver',30,20,10),
      ('sb-1235','接收天线2','pc-2-pass','m',10.7,'Hor',31,10,20),
      ('sb-1236','接收天线3','pc-3-pass','m',11.2,'Cir',32,0,30),
      ('sb-1237','接收天线4','pc-4-pass','m',11.7,'Ver',33,-10,40),
      ('sb-1238','接收天线5','pc-5-pass','m',12.2,'Hor',34,-20,50),
      ('sb-1239','接收天线6','pc-6-pass','m',12.7,'Cir',35,-30,60),
      ('sb-1240','接收天线7','pc-7-pass','m',13.2,'Ver',-36,-40,70),
      ('sb-1241','接收天线8','pc-8-pass','m',13.7,'Hor',-37,-50,80),
      ('sb-1242','接收天线9','pc-9-pass','m',14.2,'Cir',-38,-60,90),
      ('sb-1243','接收天线10','pc-10-pass','m',14.7,'Ver',-39,-70,100);

insert into lvboq (cssbdm,cssbmc,pcdm,location,fb_upper,fb_lower,freq,f_upper,f_lower,order1,s21)
values
      --lvboq
      ('sb-1234','滤波器1','pc-1-pass','m',1500,1600,1400,5,1.5),
      ('sb-1235','滤波器2','pc-1-pass','m',1550,1650,1450,5,2),
      ('sb-1236','滤波器3','pc-1-pass','m',1600,1700,1500,5,2.5),
      ('sb-1237','滤波器4','pc-1-pass','m',1650,1750,1550,5,3),
      ('sb-1238','滤波器5','pc-1-pass','m',1700,1800,1600,5,3.5),
      ('sb-1239','滤波器6','pc-1-pass','m',1750,1850,1650,5,4),
      ('sb-1240','滤波器7','pc-1-pass','m',1800,1900,1700,5,4.5),
      ('sb-1241','滤波器8','pc-1-pass','m',1850,1950,1750,5,5),
      ('sb-1242','滤波器9','pc-1-pass','m',1900,2000,1800,5,5.5),
      ('sb-1243','滤波器10','pc-1-pass','m',1950,2050,1850,5,6);

insert into dianxingtxzyzk (type_antennas,gain)
values
      -- dianxingtxzyzk
      ('喇叭天线1',10),
      ('喇叭天线2',15),
      ('喇叭天线3',20),
      ('喇叭天线4',25),
      ('喇叭天线5',30),
      ('喇叭天线6',35),
      ('喇叭天线7',40),
      ('喇叭天线8',45),
      ('喇叭天线9',50),
      ('喇叭天线10',55);

insert into tianxianzk (lib_code,lib_name)
values
      -- tianxianzk
      ('TX-sbdm1','天线库1'),
      ('TX-sbdm2','天线库2'),
      ('TX-sbdm3','天线库3'),
      ('TX-sbdm4','天线库4');

insert into jieshoujzk (lib_code,lib_name)
values
      -- jieshoujzk
      ('RE-sbdm1','接收机库1'),
      ('RE-sbdm2','接收机库2'),
      ('RE-sbdm3','接收机库3'),
      ('RE-sbdm4','接收机库4'),
      ('RE-sbdm5','接收机库5');




insert into fashejzk (lib_code,lib_name)
values
      -- fashejzk
      ('TR-sbdm1','发射机库1'),
      ('TR-sbdm2','发射机库2'),
      ('TR-sbdm3','发射机库3'),
      ('TR-sbdm4','发射机库4'),
      ('TR-sbdm5','发射机库5'),
      ('TR-sbdm6','发射机库6'),
      ('TR-sbdm7','发射机库7');

insert into ceshishysh (name,unit,level1,survey)
values
      -- ceshishysh
      ('设备1测试1','xx部门','级别1','设备1的测试类型1'),
      ('设备1测试2','xx部门','级别2','设备1的测试类型2'),
      ('设备1测试3','xx部门','级别3','设备1的测试类型3'),
      ('设备1测试4','xx部门','级别4','设备1的测试类型4'),
      ('设备1测试5','xx部门','级别5','设备1的测试类型5'),
      ('设备2测试1','xx部门','级别6','设备2的测试类型1'),
      ('设备2测试2','xx部门','级别7','设备2的测试类型2'),
      ('设备2测试3','xx部门','级别8','设备2的测试类型3'),
      ('设备2测试4','xx部门','级别9','设备2的测试类型4'),
      ('设备2测试5','xx部门','级别10','设备2的测试类型5');

insert into ceshiry (name,sex,age,edu_level,post,certificate_code,unit)
values
      -- ceshiry
      ('张三','男',25,'硕士','研究员','C12345678','xx部门'),
      ('刘芳','女',26,'硕士','研究员','C12346678','xx部门'),
      ('张锋','男',27,'硕士','研究员','C12347678','xx部门'),
      ('刘东霞','女',28,'博士','研究员','C12348678','xx部门'),
      ('刘栋','男',29,'硕士','研究员','C12349678','xx部门'),
      ('马民','男',30,'硕士','研究员','C12350678','xx部门'),
      ('马蔚宇','男',31,'学士','副研究员','C12351678','xx部门'),
      ('沈涛','女',32,'硕士','研究员','C12352678','xx部门'),
      ('李斯','男',33,'博士','研究员','C12353678','xx部门'),
      ('马玉','女',34,'硕士','研究员','C12354678','xx部门');

insert into ceshiff (m_id,m_title,range1,device,diagram,step,annotation)
values
      -- ceshiff
      ('方法1','电磁小室法1','设备类型1','EMC analyser-1','待定','步骤系列1','文本内容1'),
      ('方法2','电磁小室法2','设备类型2','EMC analyser-2','待定','步骤系列2','文本内容2'),
      ('方法3','电磁小室法3','设备类型3','EMC analyser-3','待定','步骤系列3','文本内容3'),
      ('方法4','电磁小室法4','设备类型4','EMC analyser-4','待定','步骤系列4','文本内容4'),
      ('方法5','电磁小室法5','设备类型5','EMC analyser-5','完成','步骤系列5','文本内容5'),
      ('方法6','电磁小室法6','设备类型6','EMC analyser-6','待定','步骤系列6','文本内容6'),
      ('方法7','电磁小室法7','设备类型7','EMC analyser-7','待定','步骤系列7','文本内容7'),
      ('方法8','电磁小室法8','设备类型8','EMC analyser-8','完成','步骤系列8','文本内容8'),
      ('方法9','电磁小室法9','设备类型9','EMC analyser-9','待定','步骤系列9','文本内容9'),
      ('方法10','电磁小室法10','设备类型10','EMC analyser-10','待定','步骤系列10','文本内容10');

insert into ceshibg (t_id,bailor,address,device,eut_id,eut_type,manufacturor,t_date,t_address,t_device,t_device_type,t_device_id,reference,temp,huminitily,t_man,signer,assessor,t_result)
values
      -- ceshibg
      ('CT-12345678','甲方','甲方地址1','滤波器1','LBQ-1','LBQ-T-1','xx公司','2016年12月25日','实验室1','测试仪器1','sb-1234','sb-234','依据文本',25,0.2,'张三','李四','赵五','通过'),
      ('CT-12346678','甲方','甲方地址2','发射机1','FSJ-1','FSJ-T-2','xx公司','2016年12月26日','实验室2','测试仪器2','sb-1235','sb-235','依据文本',25,0.2,'刘芳','张锋','马蔚宇','不通过'),
      ('CT-12347678','甲方','甲方地址3','接收机1','JSJ-1','JSJ-T-2','xx公司','2016年12月27日','实验室3','测试仪器3','sb-1236','sb-236','测试大纲',25,0.2,'张锋','马蔚宇','刘芳','通过'),
      ('CT-12348678','甲方','甲方地址4','天线1','TX1','TX-T-1','xx公司','2016年12月28日','实验室4','测试仪器4','sb-1237','sb-237','依据文本',25,0.2,'刘东霞','李斯','张锋','不通过'),
      ('CT-12349678','甲方','甲方地址5','天线2','TX2','TX-T-2','xx公司','2016年12月29日','实验室5','测试仪器5','sb-1238','sb-238','依据文本',25,0.2,'刘栋','马民','刘东霞','通过'),
      ('CT-12350678','甲方','甲方地址6','接收机2','JSJ-2','JSJ-T-3','xx公司','2016年12月30日','实验室6','测试仪器6','sb-1239','sb-239','测试大纲',25,0.2,'马民','刘栋','李斯','不通过'),
      ('CT-12351678','甲方','甲方地址7','发射机2','FSJ2','FSJ-T-3','xx公司','2016年12月31日','实验室7','测试仪器7','sb-1240','sb-240','依据文本',25,0.2,'马蔚宇','刘芳','刘栋','通过'),
      ('CT-12352678','甲方','甲方地址8','接地电容1','JDDR1','JDDR-T-2','xx公司','2017年1月1日','实验室8','测试仪器8','sb-1241','sb-241','依据文本',25,0.2,'沈涛','马玉','沈涛','不通过'),
      ('CT-12353678','甲方','甲方地址9','发射机4','FSJ4','FSJ-T-5','xx公司','2017年1月2日','实验室9','测试仪器9','sb-1242','sb-242','依据文本',25,0.2,'李斯','刘东霞','马民','通过'),
      ('CT-12354678','甲方','甲方地址10','接收机5','JSJ5','JSJ-T-6','xx公司','2017年1月3日','实验室10','测试仪器10','sb-1243','sb-243','依据文本',25,0.2,'马玉','沈涛','张锋','不通过');

insert into ceshixm (project_id,device,name,diagram,t_remark,t_strument,t_value,t_result)
values
      -- ceshixm
(1,'sb-1234','设备1测试1','待定','说明文本123','测试仪器-1','1,2;3,4;5,6;7,8;','测试通过'),
(2,'sb-1235','设备1测试2','待定','说明文本124','测试仪器-2','1,2;3,4;5,6;7,9;','测试不通过'),
(3,'sb-1236','设备1测试3','待定','说明文本125','测试仪器-3','1,2;3,4;5,6;7,10;','测试通过'),
(4,'sb-1237','设备1测试4','待定','说明文本126','测试仪器-4','1,2;3,4;5,6;7,11;','测试不通过'),
(5,'sb-1238','设备1测试5','完成','说明文本127','测试仪器-5','1,2;3,4;5,6;7,12;','测试通过'),
(6,'sb-1239','设备1测试6','待定','说明文本128','测试仪器-6','1,2;3,4;5,6;7,13;','测试不通过'),
(7,'sb-1240','设备1测试7','待定','说明文本129','测试仪器-7','1,2;3,4;5,6;7,14;','测试通过'),
(8,'sb-1241','设备1测试8','完成','说明文本130','测试仪器-8','1,2;3,4;5,6;7,15;','测试不通过'),
(9,'sb-1242','设备1测试9','待定','说明文本131','测试仪器-9','1,2;3,4;5,6;7,16;','测试通过'),
(10,'sb-1243','设备1测试10','待定','说明文本132','测试仪器-10','1,2;3,4;5,6;7,17;','测试不通过');
